Autodesk.Revit.DB.Point.Reference
Returns a stable reference to the point.
Remarks: This value is  if the corresponding geometry object does not permit referencing.

Autodesk.Revit.DB.Point.Coord
Returns the coordinates of the point.

Autodesk.Revit.DB.Point.Create(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Creates a point at the given coordinates and assigns it the specified color.
Since:  2016
coord:  The coordinates where the point will be created.
id:  The id of the GraphicsStyle element from which to apply the point properties.
Returns:  A Point object.

Autodesk.Revit.DB.Point.Create(Autodesk.Revit.DB.XYZ)
Creates a point at the given coordinates.
Since:  2016
coord:  The coordinates where the point will be created.
Returns:  A Point object.

Autodesk.Revit.DB.Point
A 3D point.
Remarks: The point lies at a given XYZ coordinate location.